; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport three-cities-sequential-2nodes-1000size-3degree-100mindistance-7trucks-4packages-1082seed

(define (problem transport-three-cities-sequential-2nodes-1000size-3degree-100mindistance-7trucks-4packages-1082seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-3-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-3-loc-2 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  truck-5 - vehicle
  truck-6 - vehicle
  truck-7 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 862,553 -> 194,886
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 75)
  ; 194,886 -> 862,553
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 75)
  ; 2731,477 -> 2550,46
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 47)
  ; 2550,46 -> 2731,477
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 47)
  ; 1279,2048 -> 1284,2757
  (road city-3-loc-2 city-3-loc-1)
  (= (road-length city-3-loc-2 city-3-loc-1) 71)
  ; 1284,2757 -> 1279,2048
  (road city-3-loc-1 city-3-loc-2)
  (= (road-length city-3-loc-1 city-3-loc-2) 71)
  ; 862,553 <-> 2550,46
  (road city-1-loc-2 city-2-loc-1)
  (= (road-length city-1-loc-2 city-2-loc-1) 177)
  (road city-2-loc-1 city-1-loc-2)
  (= (road-length city-2-loc-1 city-1-loc-2) 177)
  (road city-1-loc-2 city-3-loc-1)
  (= (road-length city-1-loc-2 city-3-loc-1) 177)
  (road city-3-loc-1 city-1-loc-2)
  (= (road-length city-3-loc-1 city-1-loc-2) 177)
  (road city-2-loc-2 city-3-loc-2)
  (= (road-length city-2-loc-2 city-3-loc-2) 188)
  (road city-3-loc-2 city-2-loc-2)
  (= (road-length city-3-loc-2 city-2-loc-2) 188)
  (at package-1 city-1-loc-2)
  (at package-2 city-1-loc-1)
  (at package-3 city-1-loc-2)
  (at package-4 city-3-loc-1)
  (at truck-1 city-3-loc-2)
  (capacity truck-1 capacity-3)
  (at truck-2 city-2-loc-1)
  (capacity truck-2 capacity-2)
  (at truck-3 city-3-loc-1)
  (capacity truck-3 capacity-4)
  (at truck-4 city-2-loc-2)
  (capacity truck-4 capacity-3)
  (at truck-5 city-2-loc-1)
  (capacity truck-5 capacity-4)
  (at truck-6 city-1-loc-2)
  (capacity truck-6 capacity-4)
  (at truck-7 city-1-loc-1)
  (capacity truck-7 capacity-3)
 )
 (:goal (and
  (at package-1 city-1-loc-1)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-2)
  (at package-4 city-1-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-7 city-1-loc-1 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-1) (capacity truck-7 capacity-3)
   added: (in package-2 truck-7) (capacity truck-7 capacity-2)
   goals met: 0 of 4
2. (drive truck-7 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-7 city-1-loc-1)
   added: (at truck-7 city-1-loc-2)
   goals met: 0 of 4
3. (pick-up truck-7 city-1-loc-2 package-3 capacity-1 capacity-2)
   deleted: (at package-3 city-1-loc-2) (capacity truck-7 capacity-2)
   added: (in package-3 truck-7) (capacity truck-7 capacity-1)
   goals met: 0 of 4
4. (pick-up truck-3 city-3-loc-1 package-4 capacity-3 capacity-4)
   deleted: (at package-4 city-3-loc-1) (capacity truck-3 capacity-4)
   added: (in package-4 truck-3) (capacity truck-3 capacity-3)
   goals met: 0 of 4
5. (drive truck-3 city-3-loc-1 city-1-loc-2)
   deleted: (at truck-3 city-3-loc-1)
   added: (at truck-3 city-1-loc-2)
   goals met: 0 of 4
6. (pick-up truck-3 city-1-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-2) (capacity truck-3 capacity-3)
   added: (in package-1 truck-3) (capacity truck-3 capacity-2)
   goals met: 0 of 4
7. (drop truck-3 city-1-loc-2 package-4 capacity-2 capacity-3)
   deleted: (in package-4 truck-3) (capacity truck-3 capacity-2)
   added: (at package-4 city-1-loc-2) (capacity truck-3 capacity-3)
   goals met: 1 of 4
8. (drive truck-7 city-1-loc-2 city-2-loc-1)
   deleted: (at truck-7 city-1-loc-2)
   added: (at truck-7 city-2-loc-1)
   goals met: 1 of 4
9. (drive truck-7 city-2-loc-1 city-2-loc-2)
   deleted: (at truck-7 city-2-loc-1)
   added: (at truck-7 city-2-loc-2)
   goals met: 1 of 4
10. (drive truck-3 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-3 city-1-loc-2)
   added: (at truck-3 city-1-loc-1)
   goals met: 1 of 4
11. (drop truck-3 city-1-loc-1 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-3) (capacity truck-3 capacity-3)
   added: (at package-1 city-1-loc-1) (capacity truck-3 capacity-4)
   goals met: 2 of 4
12. (drop truck-7 city-2-loc-2 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-7) (capacity truck-7 capacity-1)
   added: (at package-2 city-2-loc-2) (capacity truck-7 capacity-2)
   goals met: 3 of 4
13. (drop truck-7 city-2-loc-2 package-3 capacity-2 capacity-3)
   deleted: (in package-3 truck-7) (capacity truck-7 capacity-2)
   added: (at package-3 city-2-loc-2) (capacity truck-7 capacity-3)
   goals met: 4 of 4
